In [5]:
# dataframe的创建方式
# 导入库
import numpy as np
import pandas as pd

# 通过Series创建
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([6,7,8,9,10])
df=pd.DataFrame({'第一列：':s1,'第二列：':s2})
df

   第一列：  第二列：
0     1     6
1     2     7
2     3     8
3     4     9
4     5    10

In [12]:
# 通过字典创建
df=pd.DataFrame(
    {
        'name':['jk','qq','xx','smz','pite'],
        'age':[12,23,26,24,13],
        'scores':[78,56,87.5,90,100]
    },index=[1,2,3,4,5],columns=['name','scores','age']
)
df

   name  scores  age
1    jk    78.0   12
2    qq    56.0   23
3    xx    87.5   26
4   smz    90.0   24
5  pite   100.0   13

In [ ]:
# dataframe的属性
print('行索引：',df.index) # 行索引 index
print('列标签：',df.columns) #列标签 columns
print('值：',df.values) # 获取值 values 返回的是一个二维数组

行索引： Index([1, 2, 3, 4, 5], dtype='int64')
列标签： Index(['name', 'scores', 'age'], dtype='object')
值： [['jk' 78.0 12]
 ['qq' 56.0 23]
 ['xx' 87.5 26]
 ['smz' 90.0 24]
 ['pite' 100.0 13]]

In [24]:
print(f'维度：{df.ndim} 维') # 维度 ndim
print(f'形状：{df.shape}') # 形状 shape
print(f'元素个数：{df.size}') # 元素个数 size
print(f'数据类型：\n{df.dtypes}') # 数据类型 dtypes

维度：2 维
形状：(5, 3)
元素个数：15
数据类型：
name       object
scores    float64
age         int64
dtype: object

In [26]:
# 行列转置
df.T # 转置之后，行索引和列标签同时改变 T

           1     2     3     4      5
name      jk    qq    xx   smz   pite
scores  78.0  56.0  87.5  90.0  100.0
age       12    23    26    24     13

In [42]:
# 获取元素
print(df)
print('='*20)
print(df.loc[3]) # 显式索引 支持切片 闭区间
print('='*20)
print(df.iloc[2]) # 隐式索引 支持切片 左开右闭

   name  scores  age
1    jk    78.0   12
2    qq    56.0   23
3    xx    87.5   26
4   smz    90.0   24
5  pite   100.0   13
====================
name        xx
scores    87.5
age         26
Name: 3, dtype: object
====================
name        xx
scores    87.5
age         26
Name: 3, dtype: object

In [56]:
# 获取单个元素
print(df.at[2,'name']) # 依旧显式 at[] 获取单个值，不支持切片
print(df.iat[1,0]) # 依旧隐式 iat[] 同样不支持切片

qq
qq